In [1]:
import numpy as np
import pandas as pd

In [2]:
ser = pd.Series(np.random.random(5), name = "Column 01")

In [3]:
ser

0    0.807029
1    0.066697
2    0.313883
3    0.249309
4    0.553280
Name: Column 01, dtype: float64

In [4]:
ser[2]

0.3138831048791625

In [27]:
from pandas_datareader import data as pdr
import datetime
import yfinance as yf

In [31]:
yf.pdr_override()

start = datetime.datetime(2018, 1, 1).date()

#Shopify
data = pdr.get_data_yahoo('SHOP',start=start)

[*********************100%***********************]  1 of 1 completed

In [32]:
data

                 Open       High        Low      Close  Adj Close    Volume
Date
2018-01-02  10.159000  10.572000  10.102000  10.549000  10.549000  13945000
2018-01-03  10.636000  10.812000  10.617000  10.775000  10.775000  11627000
2018-01-04  10.833000  11.006000  10.721000  10.995000  10.995000  11610000
2018-01-05  11.055000  11.177000  10.902000  11.058000  11.058000   7710000
2018-01-08  10.999000  11.269000  10.999000  11.235000  11.235000   7487000
...               ...        ...        ...        ...        ...       ...
2023-07-14  70.610001  71.430000  68.419998  68.449997  68.449997  12088500
2023-07-17  68.599998  69.889999  67.870003  68.680000  68.680000   9671300
2023-07-18  68.459999  68.459999  65.250000  67.260002  67.260002  14982000
2023-07-19  67.879997  69.129997  67.410004  68.230003  68.230003   9139300
2023-07-20  67.269997  68.267799  65.029999  65.440002  65.440002  10490229

[1396 rows x 6 columns]

In [33]:
data.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 1396 entries, 2018-01-02 to 2023-07-20
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Open       1396 non-null   float64
 1   High       1396 non-null   float64
 2   Low        1396 non-null   float64
 3   Close      1396 non-null   float64
 4   Adj Close  1396 non-null   float64
 5   Volume     1396 non-null   int64
dtypes: float64(5), int64(1)
memory usage: 76.3 KB

In [34]:
data.head()

              Open    High     Low   Close  Adj Close    Volume
Date
2018-01-02  10.159  10.572  10.102  10.549     10.549  13945000
2018-01-03  10.636  10.812  10.617  10.775     10.775  11627000
2018-01-04  10.833  11.006  10.721  10.995     10.995  11610000
2018-01-05  11.055  11.177  10.902  11.058     11.058   7710000
2018-01-08  10.999  11.269  10.999  11.235     11.235   7487000

In [36]:
yf.pdr_override()
tickers = ['SHOP','TSLA','APPL','AMZN','ZOOM']
new_data = pd.DataFrame()


start = datetime.datetime(2018, 1, 1).date()


data = pdr.get_data_yahoo('SHOP',start=start)
for symb in tickers:
    new_data[symb] = pdr.get_data_yahoo('{}'.format(symb),start=start)['Adj Close']

[*********************100%***********************]  1 of 1 completed
[*********************100%***********************]  1 of 1 completed
[*********************100%***********************]  1 of 1 completed
[*********************100%***********************]  1 of 1 completed

1 Failed download:
['APPL']: Exception('%ticker%: No price data found, symbol may be delisted (1d 2018-01-01 -> 2023-07-20)')

[*********************100%***********************]  1 of 1 completed
[*********************100%***********************]  1 of 1 completed

1 Failed download:
['ZOOM']: Exception('%ticker%: No timezone found, symbol may be delisted')

In [38]:
#ajusted closing prices for the stocks shopify, apple, tesla, amazon and zoom
new_data.head()

              SHOP       TSLA  APPL       AMZN  ZOOM
Date
2018-01-02  10.549  21.368668   NaN  59.450500   NaN
2018-01-03  10.775  21.150000   NaN  60.209999   NaN
2018-01-04  10.995  20.974667   NaN  60.479500   NaN
2018-01-05  11.058  21.105333   NaN  61.457001   NaN
2018-01-08  11.235  22.427334   NaN  62.343498   NaN